# OUTLIER REMOVAL USING IQR

In [1]:
import pandas as pd
import numpy as np

df=pd.read_csv('heights13.csv')
df

       name  height
0     mohan     1.2
1     maria     2.3
2     sakib     4.9
3       tao     5.1
4     virat     5.2
5    khusbu     5.4
6    dmitry     5.5
7    selena     5.5
8      john     5.6
9     imran     5.6
10     jose     5.8
11  deepika     5.9
12   yoseph     6.0
13    binod     6.1
14  gulshan     6.2
15  johnson     6.5
16   donald     7.1
17    aamir    14.5
18      ken    23.2
19      Liu    40.2

IQR FORMULA IS Q3-Q1;

In [3]:
Q3=df['height'].quantile(0.75)
Q3

6.275

In [4]:
Q1=df['height'].quantile(0.25)
Q1

5.3500000000000005

NOW FINDING THE LOWER N UPPER LIMIT

In [5]:
IQR = Q3 - Q1
IQR

0.9249999999999998

In [6]:
lower_limit = Q1 - 1.5* IQR
lower_limit

3.962500000000001

In [8]:
upper_limit = Q1 + 1.5* IQR
upper_limit

6.737500000000001

NOW REMOVING THE OUTLIERS

In [9]:
df[(df['height']>lower_limit)&(df['height']<upper_limit)]

       name  height
2     sakib     4.9
3       tao     5.1
4     virat     5.2
5    khusbu     5.4
6    dmitry     5.5
7    selena     5.5
8      john     5.6
9     imran     5.6
10     jose     5.8
11  deepika     5.9
12   yoseph     6.0
13    binod     6.1
14  gulshan     6.2
15  johnson     6.5